import { Link } from 'react-router-dom'
import Slider from "react-slick";



import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";


import Footer from "../container/Footer/Footer"
import CardBox from "../container/CardBox/CardBox"
import HeaderWrapper from '../container/HeaderWrapper/HeaderWrapper'

import ImgLinkItem from '../assets/images/cardimg/card1.png'
import ImgLinkItem2 from '../assets/images/cardimg/card2.png'
import ImgLinkItem3 from '../assets/images/cardimg/card3.png'
import ImgLinkItem4 from '../assets/images/cardimg/card4.png'
import ImgLinkItem5 from '../assets/images/cardimg/card5.png'
import ImgLinkItem6 from '../assets/images/cardimg/card6.png'
import ImgLinkItem7 from '../assets/images/cardimg/card7.png'
import ImgLinkItem8 from '../assets/images/cardimg/card8.png'
import ImgLinkItem9 from '../assets/images/cardimg/card9.png'
import ImgLinkItem10 from '../assets/images/cardimg/card10.png'
import ImgLinkItem11 from '../assets/images/cardimg/card11.png'
import ImgLinkItem12 from '../assets/images/cardimg/card12.png'
import ImgLinkItem13 from '../assets/images/cardimg/card13.png'
import ImgLinkItem14 from '../assets/images/cardimg/card14.png'
import ImgLinkItem15 from '../assets/images/cardimg/card15.png'
import ImgLinkItem16 from '../assets/images/cardimg/card16.png'


import ImgLink1 from '../assets/images/cardimg/recc-img1.png'
import ImgLink2 from '../assets/images/cardimg/recc-img2.png'
import ImgLink3 from '../assets/images/cardimg/recc-img3.png'
import ImgLink4 from '../assets/images/cardimg/recc-img4.png'


const RecArr = [


	{
		imgLink: ImgLinkItem14,
		rectitle: 'Плиточник',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true

	},
	{
		imgLink: ImgLinkItem11,
		rectitle: 'Toyota Camry, 2002',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true

	},
	{
		imgLink: ImgLinkItem2,
		rectitle: 'Маркетолог. Консультирование. Настройка рекламы',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true,

	},
	{
		imgLink: ImgLinkItem3,
		rectitle: 'Требуется администратор в Отел',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true,

	},
	{
		imgLink: ImgLinkItem4,
		rectitle: 'Велосипед Merida Big Seven 70 D',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem5,
		rectitle: 'Женский, комфортный велосипед из Германии',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem6,
		rectitle: 'Коньки раздвижные Galaxy р-р 36-39',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem7,
		rectitle: 'Продам свою гоночный байк Mongoose',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem8,
		rectitle: '1-к квартира, 47 м², 7/18 эт.',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem9,
		rectitle: 'Торговое помещение, 10 м²',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem10,
		rectitle: 'Двигатели моторы головки кпп турбины тнвд гарантия',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false
	},

	{
		imgLink: ImgLinkItem12,
		rectitle: 'Сборочный комплект камаз 43118',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem13,
		rectitle: 'Продам легендарный BMW K1200S',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},

	{
		imgLink: ImgLinkItem15,
		rectitle: 'Мастер регулировка дверей замена замков',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false

	},
	{
		imgLink: ImgLinkItem16,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false


	},
	{
		imgLink: ImgLinkItem,
		rectitle: 'iPhone 6/6+ 16/64/128 Гб (Магазин 1 год гарантии)',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},


]


const RecARR = [

	{
		imgLink: ImgLink1,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink2,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true,

	},
	{
		imgLink: ImgLink3,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink4,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink1,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink2,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true,

	},
	{
		imgLink: ImgLink3,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink4,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink1,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink2,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: true,

	},
	{
		imgLink: ImgLink3,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
	{
		imgLink: ImgLink4,
		rectitle: 'Овощная компания. Доставка свежих овощей и фруктов',
		recDate: 'Вчера 22:55',
		recPrice: '39 000 000 сум',
		cardTop: false,

	},
]



const SearchPages = () => {

	function cardView() {
		document.getElementById('card-add').classList.toggle('active')
	}

	const settings = {
		dots: true,
		infinite: true,
		speed: 190,
		slidesToShow: 4,
		slidesToScroll: 1,
		autoplay: true,
		speed: 500,

	};



	return (
		<>
			<HeaderWrapper />
			<div className="search-wrapper">

				<div className="search-wrapper-top">
					<div className="container">
						<div className="search-wrapper-top-card">
							<span className="search-wrapper-top-card-lup">
								<svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path fill-rule="evenodd" clip-rule="evenodd" d="M23.6703 23.9281L16.7363 16.7159C18.5049 14.9408 19.601 12.4961 19.601 9.80051C19.601 4.39538 15.2027 0 9.80051 0C4.39538 0 0 4.39538 0 9.80051C0 15.2033 4.39538 19.601 9.80051 19.601C12.1723 19.601 14.3487 18.7511 16.0462 17.3453L22.996 24.5751C23.087 24.6707 23.2101 24.7162 23.3332 24.7162C23.4492 24.7162 23.5653 24.6731 23.6569 24.5867C23.8412 24.4088 23.8482 24.1125 23.6703 23.9281ZM9.80051 18.6665C4.91046 18.6665 0.934493 14.6882 0.934493 9.80051C0.934493 4.91046 4.91046 0.934493 9.80051 0.934493C14.6882 0.934493 18.6665 4.91046 18.6665 9.80051C18.6665 14.6882 14.6882 18.6665 9.80051 18.6665Z" fill="#9B9B9B" />
								</svg>
							</span>
							<span className="search-wrapper-top-card__text">Введите название обявления или </span>
							<Link className="search-wrapper-top-card__link">выберите из списка</Link>
						</div>

						<div className="search-wrapper-top-maps">
							<Link className="search-wrapper-top-maps__link">Интерсное</Link>
							<Link className="search-wrapper-top-maps__link">Топ</Link>
							<Link className="search-wrapper-top-maps__link">Отличные предложение</Link>
							<Link className="search-wrapper-top-maps__link">Супер цена</Link>
							<Link className="search-wrapper-top-maps__link">
								г.Ташкент
								<span>
									<svg width="7" height="11" viewBox="0 0 7 11" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path fill-rule="evenodd" clip-rule="evenodd" d="M3.50001 5.25001C2.53508 5.25001 1.74999 4.46494 1.74999 3.50001C1.74999 2.53508 2.53508 1.74999 3.50001 1.74999C4.46494 1.74999 5.25001 2.53508 5.25001 3.50001C5.25001 4.46494 4.46494 5.25001 3.50001 5.25001ZM3.50001 0C1.57012 0 0 1.57014 0 3.50001C0 4.07936 0.144826 4.65378 0.420205 5.16328L3.30859 10.3872C3.34704 10.4569 3.42032 10.5 3.50001 10.5C3.57968 10.5 3.65296 10.4569 3.69141 10.3872L6.58088 5.16158C6.85517 4.65378 7 4.07936 7 3.50001C7 1.57014 5.42988 0 3.50001 0Z" fill="#414D6A" />
									</svg>
								</span>
							</Link>
							<Link className="search-wrapper-top-maps__link">
								г.Термез
								<span>
									<svg width="7" height="11" viewBox="0 0 7 11" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path fill-rule="evenodd" clip-rule="evenodd" d="M3.50001 5.25001C2.53508 5.25001 1.74999 4.46494 1.74999 3.50001C1.74999 2.53508 2.53508 1.74999 3.50001 1.74999C4.46494 1.74999 5.25001 2.53508 5.25001 3.50001C5.25001 4.46494 4.46494 5.25001 3.50001 5.25001ZM3.50001 0C1.57012 0 0 1.57014 0 3.50001C0 4.07936 0.144826 4.65378 0.420205 5.16328L3.30859 10.3872C3.34704 10.4569 3.42032 10.5 3.50001 10.5C3.57968 10.5 3.65296 10.4569 3.69141 10.3872L6.58088 5.16158C6.85517 4.65378 7 4.07936 7 3.50001C7 1.57014 5.42988 0 3.50001 0Z" fill="#414D6A" />
									</svg>
								</span>
							</Link>
							<Link className="search-wrapper-top-maps__link">
								г.Самарканд
								<span>
									<svg width="7" height="11" viewBox="0 0 7 11" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path fill-rule="evenodd" clip-rule="evenodd" d="M3.50001 5.25001C2.53508 5.25001 1.74999 4.46494 1.74999 3.50001C1.74999 2.53508 2.53508 1.74999 3.50001 1.74999C4.46494 1.74999 5.25001 2.53508 5.25001 3.50001C5.25001 4.46494 4.46494 5.25001 3.50001 5.25001ZM3.50001 0C1.57012 0 0 1.57014 0 3.50001C0 4.07936 0.144826 4.65378 0.420205 5.16328L3.30859 10.3872C3.34704 10.4569 3.42032 10.5 3.50001 10.5C3.57968 10.5 3.65296 10.4569 3.69141 10.3872L6.58088 5.16158C6.85517 4.65378 7 4.07936 7 3.50001C7 1.57014 5.42988 0 3.50001 0Z" fill="#414D6A" />
									</svg>
								</span>
							</Link>
						</div>

						<div className="search-wrapper-top-heading">
							<span className="search-wrapper-top-heading__text">Вы сейчас в рубрике</span>

							<div className="search-wrapper-top-heading-right">
								<button className="search-wrapper-top-heading-right-button">
									<span className="search-wrapper-top-heading-right-button__text">Электроника</span>
									<span className="search-wrapper-top-heading-right-button__icon">
										<svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path fill-rule="evenodd" clip-rule="evenodd" d="M7.10525 6.25825L12.3403 1.02325C12.5743 0.78925 12.5743 0.41025 12.3403 0.17625C12.1053 -0.05875 11.7232 -0.05875 11.4882 0.17625L6.25825 5.41025L1.02325 0.17625C0.78925 -0.05875 0.41025 -0.05875 0.17625 0.17625C-0.05875 0.41025 -0.05875 0.78925 0.17625 1.02725L5.41025 6.25825L0.17625 11.4882C-0.05875 11.7232 -0.05875 12.1053 0.17625 12.3403C0.29325 12.4572 0.44525 12.5162 0.60225 12.5162C0.75425 12.5162 0.90625 12.4572 1.02325 12.3403L6.25825 7.10525L11.4882 12.3403C11.6093 12.4572 11.7622 12.5162 11.9143 12.5162C12.0663 12.5162 12.2233 12.4572 12.3403 12.3403C12.5743 12.1053 12.5743 11.7232 12.3403 11.4882L7.10525 6.25825Z" fill="#2979FF" />
										</svg>

									</span>
								</button>
								<button className="search-wrapper-top-heading-right-button">
									<span className="search-wrapper-top-heading-right-button__text">Мониторы</span>
									<span className="search-wrapper-top-heading-right-button__icon">
										<svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path fill-rule="evenodd" clip-rule="evenodd" d="M7.10525 6.25825L12.3403 1.02325C12.5743 0.78925 12.5743 0.41025 12.3403 0.17625C12.1053 -0.05875 11.7232 -0.05875 11.4882 0.17625L6.25825 5.41025L1.02325 0.17625C0.78925 -0.05875 0.41025 -0.05875 0.17625 0.17625C-0.05875 0.41025 -0.05875 0.78925 0.17625 1.02725L5.41025 6.25825L0.17625 11.4882C-0.05875 11.7232 -0.05875 12.1053 0.17625 12.3403C0.29325 12.4572 0.44525 12.5162 0.60225 12.5162C0.75425 12.5162 0.90625 12.4572 1.02325 12.3403L6.25825 7.10525L11.4882 12.3403C11.6093 12.4572 11.7622 12.5162 11.9143 12.5162C12.0663 12.5162 12.2233 12.4572 12.3403 12.3403C12.5743 12.1053 12.5743 11.7232 12.3403 11.4882L7.10525 6.25825Z" fill="#2979FF" />
										</svg>
									</span>
								</button>


							</div>
						</div>

						<div className="search-wrapper-top-price">
							<span className="search-wrapper-top-price__title">Выберите цену от и до</span>
							<div className="search-wrapper-top-price-input">
								<input type="range" name="" id="" className="search-wrapper-top-price-input__range" min="20" max="100" />
								<input type="range" name="" id="" className="search-wrapper-top-price-input__range" min="20" max="100" />
							</div>
						</div>

						<div className="search-wrapper-top-select">
							<div className="search-wrapper-top-select-first">
								<select name="" id="" className="search-wrapper-top-select-first-select">
									<option value="Состояние" className="search-wrapper-top-select-first-select__option">Состояние</option>
									<option value="Состояние" className="search-wrapper-top-select-first-select__option">Состояние</option>
									<option value="Состояние" className="search-wrapper-top-select-first-select__option">Состояние</option>
									<option value="Состояние" className="search-wrapper-top-select-first-select__option">Состояние</option>
									<option value="Состояние" className="search-wrapper-top-select-first-select__option">Состояние</option>
								</select>
							</div>
							<div className="search-wrapper-top-select-second">
								<select name="" id="" className="search-wrapper-top-select-second-select">
									<option value="Тип объявщика" className="search-wrapper-top-select-second-select__option">Тип объявщика</option>
									<option value="Тип объявщика" className="search-wrapper-top-select-second-select__option">Тип объявщика</option>
									<option value="Тип объявщика" className="search-wrapper-top-select-second-select__option">Тип объявщика</option>
									<option value="Тип объявщика" className="search-wrapper-top-select-second-select__option">Тип объявщика</option>
									<option value="Тип объявщика" className="search-wrapper-top-select-second-select__option">Тип объявщика</option>
								</select>
							</div>
							<div className="search-wrapper-top-select-third">
								<select name="" id="" className="search-wrapper-top-select-third-select">
									<option value="Ташкент > Мирза улугбекский район" className="search-wrapper-top-select-third-select__option"> Ташкент {`>`} Мирза улугбекский район</option>
									<option value="Ташкент > Мирза улугбекский район" className="search-wrapper-top-select-third-select__option"> Ташкент {`>`} Мирза улугбекский район</option>
									<option value="Ташкент > Мирза улугбекский район" className="search-wrapper-top-select-third-select__option"> Ташкент {`>`} Мирза улугбекский район</option>
									<option value="Ташкент > Мирза улугбекский район" className="search-wrapper-top-select-third-select__option"> Ташкент {`>`} Мирза улугбекский район</option>

								</select>
							</div>
						</div>
					</div>
				</div>


				<div className="search-wrapper-card-box">


					<div className="best-offer-main-rec container">
						{
							RecArr.map((item, index) => (
								<CardBox

									imgLink={item.imgLink}
									cardTitle={item.rectitle}
									cardDate={item.recDate}
									cardPrice={item.recPrice}
									key={index}
									id={index}
									cardtop={item.cardTop}
								/>
							))
						}
					</div>

					<div className="card-add" id="card-add" onClick={cardView}>
						<span className="card-add__text">
							Покозать еще(20)
					</span>

					</div>

				</div>



				<div className="search-wrapper-carusel container">
					<h2 className="search-wrapper-carusel__title">СЕЙЧАС ИЩУТ</h2>


					<div className="search-wrapper-carusel-inner">
						<Slider {...settings} className="search-wrapper-carusel-inner-carusel">


							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="15" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>
							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="15" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>

							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>

							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="15" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>

							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="15" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>

							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="15" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>

							<div className="search-wrapper-carusel-inner-carusel-card">
								<Link className="search-wrapper-carusel-inner-carusel-card__link">купить Мясная продукция </Link>
								<div className="search-wrapper-carusel-inner-carusel-card-bottom">
									<span>
										<svg width="15" height="15" viewBox="0 0 21 22" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g opacity="0.538951">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M19.8968 20.3623L14.3611 14.5262C15.7731 13.0899 16.6482 11.1116 16.6482 8.93042C16.6482 4.55668 13.1368 1 8.82408 1C4.50898 1 1 4.55668 1 8.93042C1 13.3023 4.50898 16.8608 8.82408 16.8608C10.7176 16.8608 12.4551 16.1731 13.8102 15.0355L19.3585 20.8858C19.4311 20.9632 19.5294 21 19.6277 21C19.7203 21 19.813 20.9651 19.8861 20.8952C20.0333 20.7512 20.0389 20.5115 19.8968 20.3623ZM8.82408 16.1047C4.92019 16.1047 1.74604 12.8855 1.74604 8.93042C1.74604 4.97347 4.92019 1.75618 8.82408 1.75618C12.7261 1.75618 15.9021 4.97347 15.9021 8.93042C15.9021 12.8855 12.7261 16.1047 8.82408 16.1047Z" fill="#787993" />
												<path d="M19.8968 20.3623L19.5341 20.7064L19.5347 20.7071L19.8968 20.3623ZM14.3611 14.5262L14.0046 14.1757L13.6661 14.52L13.9984 14.8703L14.3611 14.5262ZM13.8102 15.0355L14.173 14.6915L13.8492 14.35L13.4888 14.6526L13.8102 15.0355ZM19.3585 20.8858L19.7231 20.5436L19.7213 20.5417L19.3585 20.8858ZM19.8861 20.8952L20.2316 21.2567L20.2358 21.2526L19.8861 20.8952ZM20.2596 20.0182L14.7239 14.1821L13.9984 14.8703L19.5341 20.7064L20.2596 20.0182ZM14.7177 14.8767C16.218 13.3505 17.1482 11.2478 17.1482 8.93042H16.1482C16.1482 10.9755 15.3282 12.8292 14.0046 14.1757L14.7177 14.8767ZM17.1482 8.93042C17.1482 4.28682 13.4192 0.5 8.82408 0.5V1.5C12.8545 1.5 16.1482 4.82653 16.1482 8.93042H17.1482ZM8.82408 0.5C4.2265 0.5 0.5 4.28692 0.5 8.93042H1.5C1.5 4.82643 4.79147 1.5 8.82408 1.5V0.5ZM0.5 8.93042C0.5 13.572 4.22642 17.3608 8.82408 17.3608V16.3608C4.79155 16.3608 1.5 13.0326 1.5 8.93042H0.5ZM8.82408 17.3608C10.8411 17.3608 12.6912 16.6277 14.1317 15.4185L13.4888 14.6526C12.219 15.7185 10.594 16.3608 8.82408 16.3608V17.3608ZM13.4474 15.3796L18.9957 21.2298L19.7213 20.5417L14.173 14.6915L13.4474 15.3796ZM18.9939 21.2279C19.1701 21.4157 19.405 21.5 19.6277 21.5V20.5C19.6538 20.5 19.6922 20.5107 19.7231 20.5436L18.9939 21.2279ZM19.6277 21.5C19.8471 21.5 20.064 21.4168 20.2315 21.2567L19.5407 20.5337C19.562 20.5134 19.5935 20.5 19.6277 20.5V21.5ZM20.2358 21.2526C20.5762 20.9196 20.5917 20.367 20.2589 20.0175L19.5347 20.7071C19.486 20.6559 19.4904 20.5829 19.5365 20.5378L20.2358 21.2526ZM8.82408 15.6047C5.20276 15.6047 2.24604 12.6158 2.24604 8.93042H1.24604C1.24604 13.1552 4.63762 16.6047 8.82408 16.6047V15.6047ZM2.24604 8.93042C2.24604 5.24323 5.20267 2.25618 8.82408 2.25618V1.25618C4.6377 1.25618 1.24604 4.70372 1.24604 8.93042H2.24604ZM8.82408 2.25618C12.4437 2.25618 15.4021 5.24332 15.4021 8.93042H16.4021C16.4021 4.70363 13.0085 1.25618 8.82408 1.25618V2.25618ZM15.4021 8.93042C15.4021 12.6157 12.4436 15.6047 8.82408 15.6047V16.6047C13.0086 16.6047 16.4021 13.1552 16.4021 8.93042H15.4021Z" fill="#787993" />
											</g>
										</svg>

									</span>
									<span>2 часа назад</span>
								</div>
							</div>
						</Slider>
					</div>

				</div>



				<div className="big-card-carusel container">
					<h3 className="big-card-carusel__title">САМОЕ ИНТЕРЕСНОЕ</h3>
					<Slider {...settings} className="silder-box">
						{
							RecARR.map((item, index) => (

								<CardBox

									imgLink={item.imgLink}
									cardTitle={item.rectitle}
									cardDate={item.recDate}
									cardPrice={item.recPrice}
									key={index}
									id={index}

								/>
							))
						}
					</Slider>
				</div>
			</div>

			<Footer />
		</>

	)
}


export default SearchPages;